'''
반복문을 사용하여 factorial 결과 값을 예시와 같이 출력 하시오.
양의 정수를 입력 받아 num!, (num-1)!, …2!, 1! 을 계산하여 한 줄로 출력 하시오.
print(i, end=' ‘)를 사용하면 한 줄로 출력할 수 있다. 양의 정수가 아닌 값이 입력되면 “계산할 수 없는 값입니다” 출력한다.
<< 예시 >>   
5가 입력되면,  120,  24,  6,  2,  1
4가 입력되면,  24,  6,  2,  1
'''
num = int(input("양의 정수를 입력하세요: "))
if num>0:
    for i in range(num,0,-1):
        x=1
        for j in range(i,0,-1):
            x = x * j
        print(x, end=', ')

else:
    print("계산할 수 없는 값입니다.")

#j:1, x:1
#j:2, x:2
#j:3, x:6
#j:4, x:24
#j:5, x:120